
## Terraform plan for environment: `prod`

**Commit:** e9148a612b8cfede184dbc7eb8a1612c47ae4a75


**API version:** ae299e5035
**CLI version:** ae299e5035
**Selfserve version:** 38ee5c6417
**Internal version:** 38ee5c6417

### Plan summary

`7 to add, 98 to change, 2 to destroy`

**🆕 Creates**

```tf
module.service.aws_cloudwatch_log_group.this["cache-clear"]
module.service.module.batch.aws_batch_job_definition.this["cache-clear"]
module.service.module.cloudwatch_log-metric-filter["cache-clear"].aws_cloudwatch_log_metric_filter.this[0]
module.service.module.ecs_service["api"].aws_ecs_task_definition.this[0]
module.service.module.ecs_service["internal"].aws_ecs_task_definition.this[0]
module.service.module.ecs_service["selfserve"].aws_ecs_task_definition.this[0]
module.service.module.sns_batch_failure.aws_sns_topic_subscription.this["vol-app-prod-batch-failure-email-dvsa.tss-support+prod_olcs_jobs"]
```
**🗑️ Deletes**

```tf
null_resource.deployed_versions
module.service.aws_lb_listener_rule.renderer-batch["pdf-converter"]
```
**📖 Reads**

```tf
module.service.module.ecs_service["api"].data.aws_ecs_task_definition.this[0]
module.service.module.ecs_service["internal"].data.aws_ecs_task_definition.this[0]
module.service.module.ecs_service["selfserve"].data.aws_ecs_task_definition.this[0]
module.service.module.eventbridge.data.aws_iam_policy_document.additional_inline[0]
```
**🔄 Updates**

```tf
module.service.aws_cloudwatch_dashboard.this
module.service.aws_lb_listener_rule.this["pdf-converter"]
module.service.module.batch.aws_batch_job_definition.this["cancel-unsubmitted-bilateral"]
module.service.module.batch.aws_batch_job_definition.this["ch-vs-olcs-diffs"]
module.service.module.batch.aws_batch_job_definition.this["clean-up-variations"]
module.service.module.batch.aws_batch_job_definition.this["close-expired-windows"]
module.service.module.batch.aws_batch_job_definition.this["cns"]
module.service.module.batch.aws_batch_job_definition.this["company-profile-dlq"]
module.service.module.batch.aws_batch_job_definition.this["create-psv-licence-surrender-task"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-delete"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-populate"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-postcheck"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-precheck"]
module.service.module.batch.aws_batch_job_definition.this["database-maintenance"]
module.service.module.batch.aws_batch_job_definition.this["digital-continuation-reminders"]
module.service.module.batch.aws_batch_job_definition.this["duplicate-vehicle-removal"]
module.service.module.batch.aws_batch_job_definition.this["duplicate-vehicle-warning"]
module.service.module.batch.aws_batch_job_definition.this["enqueue-ch-compare"]
module.service.module.batch.aws_batch_job_definition.this["expire-bus-registration"]
module.service.module.batch.aws_batch_job_definition.this["flag-urgent-tasks"]
module.service.module.batch.aws_batch_job_definition.this["import-anondb"]
module.service.module.batch.aws_batch_job_definition.this["import-users-from-csv"]
module.service.module.batch.aws_batch_job_definition.this["inspection-request-email"]
module.service.module.batch.aws_batch_job_definition.this["interim-end-date-enforcement"]
module.service.module.batch.aws_batch_job_definition.this["international-goods-export"]
module.service.module.batch.aws_batch_job_definition.this["last-tm-letter"]
module.service.module.batch.aws_batch_job_definition.this["licence-status-rules"]
module.service.module.batch.aws_batch_job_definition.this["mark-expired-permits"]
module.service.module.batch.aws_batch_job_definition.this["ni-compliance"]
module.service.module.batch.aws_batch_job_definition.this["populate-anondb"]
module.service.module.batch.aws_batch_job_definition.this["process-cl"]
module.service.module.batch.aws_batch_job_definition.this["process-company-profile"]
module.service.module.batch.aws_batch_job_definition.this["process-inbox"]
module.service.module.batch.aws_batch_job_definition.this["process-insolvency"]
module.service.module.batch.aws_batch_job_definition.this["process-insolvency-dlq"]
module.service.module.batch.aws_batch_job_definition.this["process-ntu"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-community-licences"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-disc-generation"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-disc-print"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-ecmt-accept"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-general"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-irhp-allocate"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-permit-generation"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-permit-print"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-print"]
module.service.module.batch.aws_batch_job_definition.this["psv-operator-list-export"]
module.service.module.batch.aws_batch_job_definition.this["remove-read-audit"]
module.service.module.batch.aws_batch_job_definition.this["resolve-payments"]
module.service.module.batch.aws_batch_job_definition.this["sas-mi-extract"]
module.service.module.batch.aws_batch_job_definition.this["system-parameter"]
module.service.module.batch.aws_batch_job_definition.this["tc-bus-registered"]
module.service.module.batch.aws_batch_job_definition.this["tc-bus-variation"]
module.service.module.batch.aws_batch_job_definition.this["tc-operator-licence"]
module.service.module.batch.aws_batch_job_definition.this["transxchange-consumer"]
module.service.module.ecs_service["api"].aws_ecs_service.this[0]
module.service.module.ecs_service["internal"].aws_ecs_service.this[0]
module.service.module.ecs_service["selfserve"].aws_ecs_service.this[0]
module.service.module.eventbridge.aws_iam_policy.additional_inline[0]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-clean-up-variations-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-close-expired-windows-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-cns-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-company-profile-dlq-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-create-psv-licence-surrender-task-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-digital-continuation-reminders-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-duplicate-vehicle-removal-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-duplicate-vehicle-warning-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-enqueue-ch-compare-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-enqueue-ch-compare-1"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-expire-bus-registration-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-flag-urgent-tasks-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-inspection-request-email-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-interim-end-date-enforcement-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-international-goods-export-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-last-tm-letter-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-licence-status-rules-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-mark-expired-permits-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-process-company-profile-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-process-inbox-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-process-insolvency-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-process-insolvency-dlq-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-process-ntu-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-process-queue-community-licences-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-process-queue-disc-generation-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-process-queue-disc-print-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-process-queue-ecmt-accept-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-process-queue-general-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-process-queue-irhp-allocate-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-process-queue-permit-generation-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-process-queue-permit-print-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-process-queue-print-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-psv-operator-list-export-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-remove-read-audit-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-resolve-payments-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-sas-mi-extract-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-tc-bus-registered-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-tc-bus-variation-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-tc-operator-licence-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prod-transxchange-consumer-0"]
```


----

<details data-gh-workflow="prod-environment-plan"><summary>Show full plan</summary>

```tf


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # null_resource.deployed_versions must be replaced
-/+ resource "null_resource" "deployed_versions" {
      ~ id       = "2399863903152379231" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "deployed_api_image_tag"       = "release-v6.9.0" -> "ae299e5035"
          ~ "deployed_cli_image_tag"       = "release-v6.9.0" -> "ae299e5035"
          ~ "deployed_internal_image_tag"  = "release-v6.9.0" -> "38ee5c6417"
          ~ "deployed_selfserve_image_tag" = "release-v6.9.0" -> "38ee5c6417"
            # (1 unchanged element hidden)
        }
    }

  # module.service.aws_cloudwatch_dashboard.this will be updated in-place
  ~ resource "aws_cloudwatch_dashboard" "this" {
      ~ dashboard_body = jsonencode(
          ~ {
              ~ widgets = [
                    # (1 unchanged element hidden)
                    {
                        height     = 6
                        properties = {
                            query   = <<-EOT
                                SOURCE '/aws/events/vol-app-prod-failures' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                            region  = "eu-west-1"
                            stacked = false
                            title   = "Batch failure logs"
                            view    = "table"
                        }
                        type       = "log"
                        width      = 18
                        x          = 12
                        y          = 6
                    },
                  ~ {
                      ~ properties = {
                          ~ metrics = [
                              + [
                                  + "AWS/Logs",
                                  + "IncomingLogEvents",
                                  + "LogGroupName",
                                  + "/aws/batch/vol-app-prod-cache-clear",
                                ],
                                [
                                    "AWS/Logs",
                                    "IncomingLogEvents",
                                    "LogGroupName",
                                    "/aws/batch/vol-app-prod-ch-vs-olcs-diffs",
                                ],
                                # (52 unchanged elements hidden)
                            ]
                            # (4 unchanged attributes hidden)
                        }
                        # (5 unchanged attributes hidden)
                    },
                  + {
                      + height     = 1
                      + properties = {
                          + query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-prod-cache-clear' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "cache-clear-logs"
                          + view    = "table"
                        }
                      + type       = "log"
                      + width      = 6
                      + x          = 0
                      + y          = 0
                    },
                    {
                        height     = 1
                        properties = {
                            query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-prod-ch-vs-olcs-diffs' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                            region  = "eu-west-1"
                            stacked = false
                            title   = "ch-vs-olcs-diffs-logs"
                            view    = "table"
                        }
                        type       = "log"
                        width      = 6
                        x          = 0
                        y          = 0
                    },
                    # (52 unchanged elements hidden)
                ]
            }
        )
        id             = "batch-vol-app-prod"
        # (2 unchanged attributes hidden)
    }

  # module.service.aws_cloudwatch_log_group.this["cache-clear"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/batch/vol-app-prod-cache-clear"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "prod"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.aws_lb_listener_rule.renderer-batch["pdf-converter"] will be destroyed
  # (because aws_lb_listener_rule.renderer-batch is not in configuration)
  - resource "aws_lb_listener_rule" "renderer-batch" {
      - arn          = "arn:aws:elasticloadbalancing:eu-west-1:146997448015:listener-rule/app/APP-OLCS-PRI-SVCS-ALB/2c9f29e5ab2f38eb/873d0400e4e47490/e4188210f84b483b" -> null
      - id           = "arn:aws:elasticloadbalancing:eu-west-1:146997448015:listener-rule/app/APP-OLCS-PRI-SVCS-ALB/2c9f29e5ab2f38eb/873d0400e4e47490/e4188210f84b483b" -> null
      - listener_arn = "arn:aws:elasticloadbalancing:eu-west-1:146997448015:listener/app/APP-OLCS-PRI-SVCS-ALB/2c9f29e5ab2f38eb/873d0400e4e47490" -> null
      - priority     = 87 -> null
      - tags         = {} -> null
      - tags_all     = {
          - "Environment" = "prod"
          - "Repository"  = "https://github.com/dvsa/vol-app"
        } -> null

      - action {
          - order            = 1 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:eu-west-1:146997448015:targetgroup/vol-app-prod-pdf-converter-tg/27317899252469c9" -> null
          - type             = "forward" -> null
        }

      - condition {
          - host_header {
              - values = [
                  - "renderer.*",
                ] -> null
            }
        }
      - condition {
          - source_ip {
              - values = [
                  - "10.174.44.144/28",
                  - "10.174.44.160/28",
                  - "10.174.44.176/28",
                ] -> null
            }
        }
    }

  # module.service.aws_lb_listener_rule.this["pdf-converter"] will be updated in-place
  ~ resource "aws_lb_listener_rule" "this" {
        id           = "arn:aws:elasticloadbalancing:eu-west-1:146997448015:listener-rule/app/APP-OLCS-PRI-SVCS-ALB/2c9f29e5ab2f38eb/873d0400e4e47490/bf088c55ca7101e6"
      ~ priority     = 86 -> 5
        tags         = {}
        # (3 unchanged attributes hidden)

      - condition {
          - source_ip {
              - values = [
                  - "10.174.40.64/28",
                  - "10.174.40.80/28",
                  - "10.174.40.96/28",
                ] -> null
            }
        }
      + condition {
          + source_ip {
              + values = [
                  + "10.174.40.64/28",
                  + "10.174.40.80/28",
                  + "10.174.40.96/28",
                  + "10.174.44.144/28",
                  + "10.174.44.160/28",
                  + "10.174.44.176/28",
                ]
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["cache-clear"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = (known after apply)
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-prod-cache-clear"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "prod"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 300
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["cancel-unsubmitted-bilateral"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-cancel-unsubmitted-bilateral:8" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.9.0" -> "APP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "APP" -> "ae299e5035"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.9.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:ae299e5035"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-cancel-unsubmitted-bilateral:8"
        name                       = "vol-app-prod-cancel-unsubmitted-bilateral"
      ~ revision                   = 8 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["ch-vs-olcs-diffs"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-ch-vs-olcs-diffs:8" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.9.0" -> "APP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "APP" -> "ae299e5035"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.9.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:ae299e5035"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-ch-vs-olcs-diffs:8"
        name                       = "vol-app-prod-ch-vs-olcs-diffs"
      ~ revision                   = 8 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["clean-up-variations"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-clean-up-variations:8" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.9.0" -> "APP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "APP" -> "ae299e5035"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.9.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:ae299e5035"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-clean-up-variations:8"
        name                       = "vol-app-prod-clean-up-variations"
      ~ revision                   = 8 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["close-expired-windows"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-close-expired-windows:8" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.9.0" -> "APP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "APP" -> "ae299e5035"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.9.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:ae299e5035"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-close-expired-windows:8"
        name                       = "vol-app-prod-close-expired-windows"
      ~ revision                   = 8 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["cns"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-cns:8" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.9.0" -> "APP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "APP" -> "ae299e5035"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.9.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:ae299e5035"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-cns:8"
        name                       = "vol-app-prod-cns"
      ~ revision                   = 8 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["company-profile-dlq"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-company-profile-dlq:8" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.9.0" -> "APP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "APP" -> "ae299e5035"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.9.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:ae299e5035"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-company-profile-dlq:8"
        name                       = "vol-app-prod-company-profile-dlq"
      ~ revision                   = 8 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["create-psv-licence-surrender-task"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-create-psv-licence-surrender-task:8" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.9.0" -> "APP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "APP" -> "ae299e5035"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.9.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:ae299e5035"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-create-psv-licence-surrender-task:8"
        name                       = "vol-app-prod-create-psv-licence-surrender-task"
      ~ revision                   = 8 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-delete"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-data-retention-delete:8" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.9.0" -> "APP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "APP" -> "ae299e5035"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.9.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:ae299e5035"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-data-retention-delete:8"
        name                       = "vol-app-prod-data-retention-delete"
      ~ revision                   = 8 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-populate"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-data-retention-populate:8" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.9.0" -> "APP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "APP" -> "ae299e5035"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.9.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:ae299e5035"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-data-retention-populate:8"
        name                       = "vol-app-prod-data-retention-populate"
      ~ revision                   = 8 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-postcheck"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-data-retention-postcheck:8" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.9.0" -> "APP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "APP" -> "ae299e5035"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.9.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:ae299e5035"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-data-retention-postcheck:8"
        name                       = "vol-app-prod-data-retention-postcheck"
      ~ revision                   = 8 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-precheck"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-data-retention-precheck:8" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.9.0" -> "APP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "APP" -> "ae299e5035"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.9.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:ae299e5035"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-data-retention-precheck:8"
        name                       = "vol-app-prod-data-retention-precheck"
      ~ revision                   = 8 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["database-maintenance"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-database-maintenance:8" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.9.0" -> "APP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "APP" -> "ae299e5035"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.9.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:ae299e5035"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-database-maintenance:8"
        name                       = "vol-app-prod-database-maintenance"
      ~ revision                   = 8 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["digital-continuation-reminders"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-digital-continuation-reminders:8" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.9.0" -> "APP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "APP" -> "ae299e5035"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.9.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:ae299e5035"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-digital-continuation-reminders:8"
        name                       = "vol-app-prod-digital-continuation-reminders"
      ~ revision                   = 8 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["duplicate-vehicle-removal"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-duplicate-vehicle-removal:8" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.9.0" -> "APP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "APP" -> "ae299e5035"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.9.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:ae299e5035"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-duplicate-vehicle-removal:8"
        name                       = "vol-app-prod-duplicate-vehicle-removal"
      ~ revision                   = 8 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["duplicate-vehicle-warning"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-duplicate-vehicle-warning:8" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.9.0" -> "APP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "APP" -> "ae299e5035"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.9.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:ae299e5035"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-duplicate-vehicle-warning:8"
        name                       = "vol-app-prod-duplicate-vehicle-warning"
      ~ revision                   = 8 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["enqueue-ch-compare"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-enqueue-ch-compare:8" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.9.0" -> "APP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "APP" -> "ae299e5035"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.9.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:ae299e5035"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-enqueue-ch-compare:8"
        name                       = "vol-app-prod-enqueue-ch-compare"
      ~ revision                   = 8 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["expire-bus-registration"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-expire-bus-registration:8" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.9.0" -> "APP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "APP" -> "ae299e5035"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.9.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:ae299e5035"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-expire-bus-registration:8"
        name                       = "vol-app-prod-expire-bus-registration"
      ~ revision                   = 8 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["flag-urgent-tasks"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-flag-urgent-tasks:8" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.9.0" -> "APP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "APP" -> "ae299e5035"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.9.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:ae299e5035"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-flag-urgent-tasks:8"
        name                       = "vol-app-prod-flag-urgent-tasks"
      ~ revision                   = 8 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["import-anondb"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-import-anondb:9" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  - {
                      - name  = "APP_VERSION"
                      - value = "release-v6.9.0"
                    },
                  - {
                      - name  = "DOMAIN"
                      - value = "dvsacloud.uk"
                    },
                    {
                        name  = "ENVIRONMENT_NAME"
                        value = "APP"
                    },
                    {
                        name  = "FULL_DOMAIN"
                        value = "prod.olcs.dvsacloud.uk"
                    },
                  + {
                      + name  = "DOMAIN"
                      + value = "dvsacloud.uk"
                    },
                  + {
                      + name  = "READDB_HOST"
                      + value = "olcsreaddb-rds.app.olcs.dvsacloud.uk"
                    },
                    {
                        name  = "PROXY"
                        value = "proxy.prod.olcs.dvsacloud.uk:3128"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "ae299e5035"
                    },
                    {
                        name  = "READDB_HOST"
                        value = "olcsreaddb-rds.prod.olcs.dvsacloud.uk"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.9.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:ae299e5035"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-import-anondb:9"
        name                       = "vol-app-prod-import-anondb"
      ~ revision                   = 9 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["import-users-from-csv"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-import-users-from-csv:8" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.9.0" -> "APP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "APP" -> "ae299e5035"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.9.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:ae299e5035"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-import-users-from-csv:8"
        name                       = "vol-app-prod-import-users-from-csv"
      ~ revision                   = 8 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["inspection-request-email"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-inspection-request-email:8" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.9.0" -> "APP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "APP" -> "ae299e5035"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.9.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:ae299e5035"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-inspection-request-email:8"
        name                       = "vol-app-prod-inspection-request-email"
      ~ revision                   = 8 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["interim-end-date-enforcement"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-interim-end-date-enforcement:8" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.9.0" -> "APP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "APP" -> "ae299e5035"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.9.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:ae299e5035"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-interim-end-date-enforcement:8"
        name                       = "vol-app-prod-interim-end-date-enforcement"
      ~ revision                   = 8 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["international-goods-export"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-international-goods-export:8" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.9.0" -> "APP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "APP" -> "ae299e5035"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.9.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:ae299e5035"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-international-goods-export:8"
        name                       = "vol-app-prod-international-goods-export"
      ~ revision                   = 8 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["last-tm-letter"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-last-tm-letter:8" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.9.0" -> "APP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "APP" -> "ae299e5035"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.9.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:ae299e5035"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-last-tm-letter:8"
        name                       = "vol-app-prod-last-tm-letter"
      ~ revision                   = 8 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["licence-status-rules"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-licence-status-rules:8" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.9.0" -> "APP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "APP" -> "ae299e5035"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.9.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:ae299e5035"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-licence-status-rules:8"
        name                       = "vol-app-prod-licence-status-rules"
      ~ revision                   = 8 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["mark-expired-permits"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-mark-expired-permits:8" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.9.0" -> "APP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "APP" -> "ae299e5035"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.9.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:ae299e5035"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-mark-expired-permits:8"
        name                       = "vol-app-prod-mark-expired-permits"
      ~ revision                   = 8 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["ni-compliance"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-ni-compliance:9" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  - {
                      - name  = "APP_VERSION"
                      - value = "release-v6.9.0"
                    },
                  - {
                      - name  = "DOMAIN"
                      - value = "dvsacloud.uk"
                    },
                    {
                        name  = "ENVIRONMENT_NAME"
                        value = "APP"
                    },
                    {
                        name  = "FULL_DOMAIN"
                        value = "prod.olcs.dvsacloud.uk"
                    },
                  + {
                      + name  = "DOMAIN"
                      + value = "dvsacloud.uk"
                    },
                  + {
                      + name  = "READDB_HOST"
                      + value = "olcsreaddb-rds.app.olcs.dvsacloud.uk"
                    },
                    {
                        name  = "PROXY"
                        value = "proxy.prod.olcs.dvsacloud.uk:3128"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "ae299e5035"
                    },
                    {
                        name  = "READDB_HOST"
                        value = "olcsreaddb-rds.prod.olcs.dvsacloud.uk"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.9.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:ae299e5035"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-ni-compliance:9"
        name                       = "vol-app-prod-ni-compliance"
      ~ revision                   = 9 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["populate-anondb"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-populate-anondb:9" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  - {
                      - name  = "APP_VERSION"
                      - value = "release-v6.9.0"
                    },
                  - {
                      - name  = "DOMAIN"
                      - value = "dvsacloud.uk"
                    },
                    {
                        name  = "ENVIRONMENT_NAME"
                        value = "APP"
                    },
                    {
                        name  = "FULL_DOMAIN"
                        value = "prod.olcs.dvsacloud.uk"
                    },
                  + {
                      + name  = "DOMAIN"
                      + value = "dvsacloud.uk"
                    },
                  + {
                      + name  = "READDB_HOST"
                      + value = "olcsreaddb-rds.app.olcs.dvsacloud.uk"
                    },
                    {
                        name  = "PROXY"
                        value = "proxy.prod.olcs.dvsacloud.uk:3128"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "ae299e5035"
                    },
                    {
                        name  = "READDB_HOST"
                        value = "olcsreaddb-rds.prod.olcs.dvsacloud.uk"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.9.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:ae299e5035"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-populate-anondb:9"
        name                       = "vol-app-prod-populate-anondb"
      ~ revision                   = 9 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-cl"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-process-cl:8" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.9.0" -> "APP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "APP" -> "ae299e5035"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.9.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:ae299e5035"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-process-cl:8"
        name                       = "vol-app-prod-process-cl"
      ~ revision                   = 8 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-company-profile"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-process-company-profile:8" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.9.0" -> "APP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "APP" -> "ae299e5035"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.9.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:ae299e5035"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-process-company-profile:8"
        name                       = "vol-app-prod-process-company-profile"
      ~ revision                   = 8 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-inbox"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prod-process-inbox:8" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [... (truncated, see full plan in the workflow run logs)
```

</details>